Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartHasInvalidGeometry Property
 The fabrication part either has no material or has badly configured dimensions, resulting in bad geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartHasInvalidGeometry { get; }
Public Shared ReadOnly Property FabricationPartHasInvalidGeometry As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartHasInvalidGeometry {
	FailureDefinitionId^ get ();
}
static member FabricationPartHasInvalidGeometry : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace